#+LATEX_HEADER: \usepackage{xeCJK}
#+LATEX_HEADER: \setmainfont{"微软雅黑"}
#+ATTR_LATEX: :width 5cm :options angle=90
#+TITLE: Canlendars
#+AUTHOR: 杨 睿
#+EMAIL: yangruipis@163.com
#+KEYWORDS: GTD
#+OPTIONS: H:4 toc:t 
#+PROPERTY: CLOCK_INTO_DRAWER t
#+PROPERTY: LOG_INTO_DRAWER t
#+TAGS: { code(c) theory(t) school(s) easy(e) project(p) daily(d) weekly(w) }

* Work

** TODO 个人项目：simple_ml                                :project:weekly:
:LOGBOOK:  
- State "TODO"       from ""           [2018-05-28 一 14:49]
- State "DONE"       from "SOMEDAY"    [2018-05-28 一 14:47]
- State "FIXED"      from "TODO"       [2018-05-28 一 14:47]
- State "FIXED"      from "TODO"       [2018-05-28 一 14:47]
- State "FIXED"      from "TODO"       [2018-05-28 一 14:47]
- State "TODO"       from "SOMEDAY"    [2018-05-28 一 14:47]
- State "DONE"       from "SOMEDAY"    [2018-05-28 一 14:47]
- State "FIXED"      from "TODO"       [2018-05-28 一 14:47]
- State "FIXED"      from "TODO"       [2018-05-28 一 14:47]
- State "TODO"       from "SOMEDAY"    [2018-05-28 一 14:47]
- State "FIXED"      from "TODO"       [2018-05-28 一 14:47]
- State "DONE"       from "TODO"       [2018-05-22 二 14:49]
:END:      
- State "DONE"       from "TODO"       [2018-05-15 二 15:13]

SCHEDULED: <2018-06-09 六 ++1w>
:PROPERTIES:
:LAST_REPEAT: [2018-05-28 一 14:47]
:END:

** TODO 导师组会                                                    :weekly:
SCHEDULED: <2018-06-11 一 13:00-15:30 ++2w>
- State "DONE"       from "TODO"       [2018-05-21 一 15:05]
:LOGBOOK:  
CLOCK: [2018-05-21 一 14:15]--[2018-05-21 一 14:47] =>  0:32
CLOCK: [2018-05-21 一 13:09]--[2018-05-21 一 13:40] =>  0:31
:END:      
:PROPERTIES:
:LAST_REPEAT: [2018-05-21 一 15:05]
:END:

** TODO Weekly Review
DEADLINE: <2018-06-10 日 18:00-21:00 ++1w>
:PROPERTIES:
:LAST_REPEAT: [2018-06-05 二 11:22]
:END:

:LOGBOOK:  
- State "DONE"       from "TODO"       [2018-06-05 二 11:22]
- State "DONE"       from "TODO"       [2018-05-28 一 09:32]
- State "TODO"       from ""           [2018-05-26 六 12:56]
:END:      

* Learning

** CANCELED [#B] 刷编程题                                      :code:daily:
SCHEDULED: <2018-06-06 三 13:30-16:00>
:LOGBOOK:  
- State "CANCELED"   from "TODO"       [2018-06-05 二 11:20]
- State "CANCELED"   from "TODO"       [2018-06-05 二 11:20]
CLOCK: [2018-05-31 四 20:01]--[2018-05-31 四 20:26] =>  0:25
CLOCK: [2018-05-31 四 19:18]--[2018-05-31 四 19:43] =>  0:25
CLOCK: [2018-05-31 四 17:47]--[2018-05-31 四 18:12] =>  0:25
CLOCK: [2018-05-31 四 15:38]--[2018-05-31 四 16:03] =>  0:25
CLOCK: [2018-05-31 四 15:02]--[2018-05-31 四 15:27] =>  0:25
CLOCK: [2018-05-31 四 14:21]--[2018-05-31 四 14:46] =>  0:25
- State "DONE"       from "TODO"       [2018-05-30 三 19:58]
CLOCK: [2018-05-30 三 13:41]--[2018-05-30 三 14:02] =>  0:21
CLOCK: [2018-05-30 三 13:09]--[2018-05-30 三 13:34] =>  0:25
CLOCK: [2018-05-30 三 11:54]--[2018-05-30 三 12:19] =>  0:25
CLOCK: [2018-05-30 三 11:41]--[2018-05-30 三 11:53] =>  0:12
CLOCK: [2018-05-30 三 10:56]--[2018-05-30 三 11:02] =>  0:06
CLOCK: [2018-05-30 三 10:15]--[2018-05-30 三 10:40] =>  0:25
CLOCK: [2018-05-30 三 09:45]--[2018-05-30 三 10:10] =>  0:25
CLOCK: [2018-05-29 二 23:39]--[2018-05-29 二 23:39] =>  0:00
- State "DONE"       from "TODO"       [2018-05-29 二 22:48]
CLOCK: [2018-05-29 二 15:35]--[2018-05-29 二 16:00] =>  0:25
- State "DONE"       from "TODO"       [2018-05-28 一 19:25]
CLOCK: [2018-05-28 一 15:24]--[2018-05-28 一 16:07] =>  0:43
CLOCK: [2018-05-28 一 14:51]--[2018-05-28 一 15:04] =>  0:13
CLOCK: [2018-05-28 一 14:03]--[2018-05-28 一 14:38] =>  0:35
- State "DONE"       from "TODO"       [2018-05-26 六 10:06]
CLOCK: [2018-05-25 五 13:23]--[2018-05-25 五 14:04] =>  0:41
- State "DONE"       from "TODO"       [2018-05-24 四 16:35]
CLOCK: [2018-05-24 四 14:27]--[2018-05-24 四 16:35] =>  2:08
- State "DONE"       from "TODO"       [2018-05-22 二 21:17]
CLOCK: [2018-05-22 二 20:29]--[2018-05-22 二 20:30] =>  0:01
:END:      
- State "DONE"       from "TODO"       [2018-05-21 一 16:16]
:PROPERTIES:
:LAST_REPEAT: [2018-06-05 二 11:20]
:END:

*** 2018-05-16
CLOCK: [2018-05-16 三 13:51]--[2018-05-16 三 17:03] =>  3:12

- 网易有道2017内推选择题，牛客网 https://www.nowcoder.com/profile/5924424/test/15754391/46325

*** 2018-05-21
:LOGBOOK:  
CLOCK: [2018-05-22 二 14:50]--[2018-05-22 二 16:18] =>  1:28
CLOCK: [2018-05-21 一 15:15]--[2018-05-21 一 16:15] =>  1:00
CLOCK: [2018-05-21 一 15:06]--[2018-05-21 一 15:14] =>  0:08
:END:      

- 京东2018算法工程师，牛客网: https://www.nowcoder.com/test/10630581/summary

*** 2018-05-22
:LOGBOOK:  
CLOCK: [2018-05-22 二 20:30]--[2018-05-22 二 21:17] =>  0:47
:END:      


编程题：
https://www.nowcoder.com/ta/2017test
- 优雅的点 
- 藏宝图： 贪心、动态规划

*** 2018-05-24

1. 子序列问题： https://blog.csdn.net/xblog_/article/details/72596370
2. 混合颜料： https://www.nowcoder.com/ta/2017test

*** 2018-05-25

1. 地牢逃脱
2. 下厨房
3. 分田地

*** 2018-05-28

尝试用Java实现所有基本算法,配置本地JAVA环境

~重刷 剑指offer~

** CANCELED [#B] 复习机器学习                                :theory:daily:
SCHEDULED: <2018-06-06 三 10:00-11:00>

:LOGBOOK:
- State "CANCELED"   from "TODO"       [2018-06-05 二 11:20]
- State "CANCELED"   from "TODO"       [2018-06-05 二 11:20]
- State "DONE"       from "TODO"       [2018-05-31 四 14:20]
CLOCK: [2018-05-31 四 13:23]--[2018-05-31 四 13:48] =>  0:25
CLOCK: [2018-05-31 四 12:20]--[2018-05-31 四 12:45] =>  0:25
CLOCK: [2018-05-31 四 11:15]--[2018-05-31 四 11:40] =>  0:25
CLOCK: [2018-05-31 四 10:40]--[2018-05-31 四 11:05] =>  0:25
- State "DONE"       from "TODO"       [2018-05-30 三 19:58]
- State "DONE"       from "TODO"       [2018-05-29 二 15:29]
CLOCK: [2018-05-29 二 14:55]--[2018-05-29 二 15:20] =>  0:25
CLOCK: [2018-05-29 二 13:53]--[2018-05-29 二 14:18] =>  0:25
CLOCK: [2018-05-29 二 13:04]--[2018-05-29 二 13:29] =>  0:25
CLOCK: [2018-05-29 二 12:12]--[2018-05-29 二 12:37] =>  0:25
CLOCK: [2018-05-29 二 11:41]--[2018-05-29 二 12:06] =>  0:25
CLOCK: [2018-05-29 二 11:11]--[2018-05-29 二 11:36] =>  0:25
- State "DONE"       from "TODO"       [2018-05-28 一 14:02]
CLOCK: [2018-05-28 一 13:31]--[2018-05-28 一 13:56] =>  0:25
CLOCK: [2018-05-28 一 10:47]--[2018-05-28 一 11:12] =>  0:25
CLOCK: [2018-05-28 一 10:17]--[2018-05-28 一 10:42] =>  0:25
CLOCK: [2018-05-28 一 09:45]--[2018-05-28 一 10:10] =>  0:25
- State "DONE"       from "TODO"       [2018-05-27 日 17:36]
CLOCK: [2018-05-26 六 13:58]--[2018-05-26 六 14:21] =>  0:23
CLOCK: [2018-05-26 六 13:28]--[2018-05-26 六 13:43] =>  0:15
CLOCK: [2018-05-26 六 12:52]--[2018-05-26 六 13:17] =>  0:25
CLOCK: [2018-05-26 六 12:13]--[2018-05-26 六 12:43] =>  0:30
- State "TODO"       from "SOMEDAY"    [2018-05-25 五 12:27]
- State "FIXED"      from "TODO"       [2018-05-25 五 12:27]
- State "DONE"       from "TODO"       [2018-05-25 五 11:05]
CLOCK: [2018-05-25 五 09:39]--[2018-05-25 五 11:05] =>  1:26
- State "DONE"       from "TODO"       [2018-05-24 四 13:56]
CLOCK: [2018-05-24 四 11:55]--[2018-05-24 四 12:43] =>  0:48
CLOCK: [2018-05-24 四 11:10]--[2018-05-24 四 11:20] =>  0:10
- State "CANCELED"   from "TODO"       [2018-05-24 四 11:09]
- State "DONE"       from "TODO"       [2018-05-22 二 13:13]
CLOCK: [2018-05-22 二 09:44]--[2018-05-22 二 11:23] =>  1:39
- State "TODO"       from "TODO"       [2018-05-22 二 09:21]
- State "DONE"       from "TODO"       [2018-05-21 一 16:16]
- State "DONE"       from "TODO"       [2018-05-20 日 23:18]
- State "DONE"       from "TODO"       [2018-05-17 四 11:47]
- State "DONE"       from "TODO"       [2018-05-16 三 22:21]
- State "DONE"       from "TODO"       [2018-05-15 二 15:14]
- State "TODO"       from "TODO"       [2018-05-15 二 15:13]
:END:
      
:PROPERTIES:
:LAST_REPEAT: [2018-06-05 二 11:20]
:END:

*** DONE 数据预处理
- State "DONE"       from "TODO"       [2018-05-21 一 11:13]
:LOGBOOK:  
CLOCK: [2018-05-22 二 09:44]--[2018-05-22 二 09:44] =>  0:00
CLOCK: [2018-05-21 一 10:30]--[2018-05-21 一 11:13] =>  0:43
CLOCK: [2018-05-21 一 09:57]--[2018-05-21 一 10:19] =>  0:22
CLOCK: [2018-05-21 一 09:56]--[2018-05-21 一 09:57] =>  0:01
CLOCK: [2018-05-16 三 12:59]--[2018-05-16 三 13:43] =>  0:44
CLOCK: [2018-05-16 三 12:28]--[2018-05-16 三 12:34] =>  0:06
CLOCK: [2018-05-16 三 09:55]--[2018-05-16 三 10:15] =>  0:20
CLOCK: [2018-05-16 三 09:55]--[2018-05-16 三 09:55] =>  0:00
:END:      

- State "TODO"       from ""           [2018-05-16 三 09:43]

**** 详细步骤
CLOCK: [2018-05-17 四 11:49]--[2018-05-17 四 12:11] =>  0:22
CLOCK: [2018-05-16 三 12:59]--[2018-05-16 三 12:59] =>  0:00

拿到数据，分为两类：
- 未脱敏的数据，知道每个变量的具体含义
- 脱敏数据，不知道每个变量的含义

** CANCELED [#B] 学习JAVA                                      :code:daily:
SCHEDULED: <2018-06-06 三 18:30-20:00>

:LOGBOOK:  
- State "CANCELED"   from "TODO"       [2018-06-05 二 11:21]
- State "CANCELED"   from "TODO"       [2018-06-05 二 11:21]
- State "CANCELED"   from "TODO"       [2018-05-29 二 22:48]
- State "DONE"       from "TODO"       [2018-05-28 一 21:27]
CLOCK: [2018-05-28 一 20:13]--[2018-05-28 一 20:38] =>  0:25
CLOCK: [2018-05-28 一 19:25]--[2018-05-28 一 19:50] =>  0:25
- State "TODO"       from "SOMEDAY"    [2018-05-28 一 14:34]
- State "TODO"       from ""           [2018-05-28 一 14:34]
:PROPERTIES:
:LAST_REPEAT: [2018-06-05 二 11:21]
:END:
:END:      

** CANCELED [#B] Daily Review                                       :daily:
SCHEDULED: <2018-05-30 三 20:30-21:00>
:LOGBOOK:  
- State "CANCELED"   from "TODO"       [2018-06-05 二 11:21]
CLOCK: [2018-05-30 三 22:21]--[2018-05-30 三 22:46] =>  0:25
CLOCK: [2018-05-30 三 21:51]--[2018-05-30 三 22:16] =>  0:25
CLOCK: [2018-05-30 三 20:02]--[2018-05-30 三 20:27] =>  0:25
- State "DONE"       from "TODO"       [2018-05-29 二 22:48]
- State "CANCELED"   from "TODO"       [2018-05-28 一 14:46]
- State "DONE"       from "TODO"       [2018-05-22 二 21:17]
:END:      
- State "DONE"       from "TODO"       [2018-05-21 一 20:57]
- State "DONE"       from "TODO"       [2018-05-20 日 23:18]
- State "DONE"       from "TODO"       [2018-05-16 三 22:21]
:PROPERTIES:
:LAST_REPEAT: [2018-05-29 二 22:48]
:END:

** CANCELED [#C] 阅读（书籍、源码、文献、前沿文章）                 :daily:
SCHEDULED: <2018-05-30 三 21:00-22:00>
:LOGBOOK:  
- State "CANCELED"   from "TODO"       [2018-06-05 二 11:21]
- State "CANCELED"   from "TODO"       [2018-05-29 二 22:48]
- State "CANCELED"   from "TODO"       [2018-05-28 一 14:46]
- State "DONE"       from "TODO"       [2018-05-27 日 17:36]
- State "DONE"       from "TODO"       [2018-05-22 二 14:49]
:END:      
- State "DONE"       from "TODO"       [2018-05-20 日 23:18]
- State "DONE"       from "TODO"       [2018-05-16 三 22:21]
- State "DONE"       from "TODO"       [2018-05-15 二 21:17]
CLOCK: [2018-05-15 二 20:20]--[2018-05-15 二 20:56] =>  0:36
:PROPERTIES:
:LAST_REPEAT: [2018-05-29 二 22:48]
:END:

books to read

- [ ] 深度学习 caffe 21天实战 
- [ ] 算法图解： [[file:~/Documents/Data/books/%E7%AE%97%E6%B3%95%E5%9B%BE%E8%A7%A3.pdf][file:~/Documents/Data/books/算法图解.pdf]] 



* Hobbies


